betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_irda.h
/** @defgroup IRDA_Flags IRDA Flags
  *        Elements values convention: 0xXXXX
  *           - 0xXXXX  : Flag mask in the SR register
  * @{
  */
#define IRDA_FLAG_TXE              ((uint32_t)USART_STS_TXBEFLG)
#define IRDA_FLAG_TC               ((uint32_t)USART_STS_TXCFLG)
#define IRDA_FLAG_RXNE             ((uint32_t)USART_STS_RXBNEFLG)
#define IRDA_FLAG_IDLE             ((uint32_t)USART_STS_IDLEFLG)
#define IRDA_FLAG_ORE              ((uint32_t)USART_STS_OVREFLG)
#define IRDA_FLAG_NE               ((uint32_t)USART_STS_NEFLG)
#define IRDA_FLAG_FE               ((uint32_t)USART_STS_FEFLG)
#define IRDA_FLAG_PE               ((uint32_t)USART_STS_PEFLG)
/**
  * @}
  */

/** @defgroup IRDA_Interrupt_definition IRDA Interrupt Definitions
  *        Elements values convention: 0xY000XXXX
  *           - XXXX  : Interrupt mask in the XX register
  *           - Y  : Interrupt source register (2bits)
  *                 - 01: CTRL1 register
  *                 - 10: CTRL2 register
  *                 - 11: CTRL3 register
  * @{
  */
#define IRDA_IT_PE                 ((uint32_t)(IRDA_CTRL1_REG_INDEX << 28U | USART_CTRL1_PEIEN))
#define IRDA_IT_TXE                ((uint32_t)(IRDA_CTRL1_REG_INDEX << 28U | USART_CTRL1_TXBEIEN))
#define IRDA_IT_TC                 ((uint32_t)(IRDA_CTRL1_REG_INDEX << 28U | USART_CTRL1_TXCIEN))
#define IRDA_IT_RXNE               ((uint32_t)(IRDA_CTRL1_REG_INDEX << 28U | USART_CTRL1_RXBNEIEN))
#define IRDA_IT_IDLE               ((uint32_t)(IRDA_CTRL1_REG_INDEX << 28U | USART_CTRL1_IDLEIEN))

#define IRDA_IT_LBD                ((uint32_t)(IRDA_CTRL2_REG_INDEX << 28U | USART_CTRL2_LBDIEN))

#define IRDA_IT_CTS                ((uint32_t)(IRDA_CTRL3_REG_INDEX << 28U | USART_CTRL3_CTSIEN))
#define IRDA_IT_ERR                ((uint32_t)(IRDA_CTRL3_REG_INDEX << 28U | USART_CTRL3_ERRIEN))
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup IRDA_Exported_Macros IRDA Exported Macros
  * @{
  */

/** @brief Reset IRDA handle gstate & RxState
  * @param  __HANDLE__ specifies the IRDA Handle.
  *         IRDA Handle selects the USARTx or UARTy peripheral
  *         (USART,UART availability and x,y values depending on device).
  * @retval None
  */
#if USE_DAL_IRDA_REGISTER_CALLBACKS == 1
#define __DAL_IRDA_RESET_HANDLE_STATE(__HANDLE__)  do{                                                   \
                                                       (__HANDLE__)->gState = DAL_IRDA_STATE_RESET;      \
                                                       (__HANDLE__)->RxState = DAL_IRDA_STATE_RESET;     \
                                                       (__HANDLE__)->MspInitCallback = NULL;             \
                                                       (__HANDLE__)->MspDeInitCallback = NULL;           \
                                                     } while(0U)
#else
#define __DAL_IRDA_RESET_HANDLE_STATE(__HANDLE__)  do{                                                   \
                                                       (__HANDLE__)->gState = DAL_IRDA_STATE_RESET;      \
                                                       (__HANDLE__)->RxState = DAL_IRDA_STATE_RESET;     \
                                                     } while(0U)
#endif /*USE_DAL_IRDA_REGISTER_CALLBACKS  */

/** @brief  Flush the IRDA DATA register
  * @param  __HANDLE__ specifies the IRDA Handle.
  *         IRDA Handle selects the USARTx or UARTy peripheral
  *         (USART,UART availability and x,y values depending on device).
  * @retval None
  */
#define __DAL_IRDA_FLUSH_DRREGISTER(__HANDLE__) ((__HANDLE__)->Instance->DATA)

/** @brief  Check whether the specified IRDA flag is set or not.
  * @param  __HANDLE__ specifies the IRDA Handle.
  *         IRDA Handle selects the USARTx or UARTy peripheral
  *         (USART,UART availability and x,y values depending on device).
  * @param  __FLAG__ specifies the flag to check.
  *        This parameter can be one of the following values:
  *            @arg IRDA_FLAG_TXE:  Transmit data register empty flag
  *            @arg IRDA_FLAG_TC:   Transmission Complete flag
  *            @arg IRDA_FLAG_RXNE: Receive data register not empty flag
  *            @arg IRDA_FLAG_IDLE: Idle Line detection flag
  *            @arg IRDA_FLAG_ORE:  OverRun Error flag
  *            @arg IRDA_FLAG_NE:   Noise Error flag
  *            @arg IRDA_FLAG_FE:   Framing Error flag
  *            @arg IRDA_FLAG_PE:   Parity Error flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __DAL_IRDA_GET_FLAG(__HANDLE__, __FLAG__) (((__HANDLE__)->Instance->STS & (__FLAG__)) == (__FLAG__))

/** @brief  Clear the specified IRDA pending flag.
  * @param  __HANDLE__ specifies the IRDA Handle.
  *         IRDA Handle selects the USARTx or UARTy peripheral
  *         (USART,UART availability and x,y values depending on device).
  * @param  __FLAG__ specifies the flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg IRDA_FLAG_TC:   Transmission Complete flag.
  *            @arg IRDA_FLAG_RXNE: Receive data register not empty flag.
  *
  * @note   PE (Parity error), FE (Framing error), NE (Noise error), ORE (OverRun
  *          error) and IDLE (Idle line detected) flags are cleared by software
  *          sequence: a read operation to USART_STS register followed by a read
  *          operation to USART_DATA register.
  * @note   RXNE flag can be also cleared by a read to the USART_DATA register.
  * @note   TC flag can be also cleared by software sequence: a read operation to
  *          USART_STS register followed by a write operation to USART_DATA register.
  * @note   TXE flag is cleared only by a write to the USART_DATA register.
  * @retval None
  */
#define __DAL_IRDA_CLEAR_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->STS = ~(__FLAG__))

/** @brief  Clear the IRDA PE pending flag.
  * @param  __HANDLE__ specifies the IRDA Handle.
  *         IRDA Handle selects the USARTx or UARTy peripheral
  *         (USART,UART availability and x,y values depending on device).
  * @retval None
  */
#define __DAL_IRDA_CLEAR_PEFLAG(__HANDLE__)     \
  do{                                           \
    __IO uint32_t tmpreg = 0x00U;               \
    tmpreg = (__HANDLE__)->Instance->STS;        \
    tmpreg = (__HANDLE__)->Instance->DATA;        \
    UNUSED(tmpreg);                             \
  } while(0U)

