betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_irda.h
/** @brief  Enable UART/USART associated to IRDA Handle
  * @param  __HANDLE__ specifies the IRDA Handle.
  *         IRDA Handle selects the USARTx or UARTy peripheral
  *         (USART,UART availability and x,y values depending on device).
  * @retval None
  */
#define __DAL_IRDA_ENABLE(__HANDLE__)                   (SET_BIT((__HANDLE__)->Instance->CTRL1, USART_CTRL1_UEN))

/** @brief  Disable UART/USART associated to IRDA Handle
  * @param  __HANDLE__ specifies the IRDA Handle.
  *         IRDA Handle selects the USARTx or UARTy peripheral
  *         (USART,UART availability and x,y values depending on device).
  * @retval None
  */
#define __DAL_IRDA_DISABLE(__HANDLE__)                  (CLEAR_BIT((__HANDLE__)->Instance->CTRL1, USART_CTRL1_UEN))

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup IRDA_Exported_Functions
  * @{
  */

/** @addtogroup IRDA_Exported_Functions_Group1
  * @{
  */
/* Initialization/de-initialization functions  **********************************/
DAL_StatusTypeDef DAL_IRDA_Init(IRDA_HandleTypeDef *hirda);
DAL_StatusTypeDef DAL_IRDA_DeInit(IRDA_HandleTypeDef *hirda);
void DAL_IRDA_MspInit(IRDA_HandleTypeDef *hirda);
void DAL_IRDA_MspDeInit(IRDA_HandleTypeDef *hirda);

#if (USE_DAL_IRDA_REGISTER_CALLBACKS == 1)
/* Callbacks Register/UnRegister functions  ***********************************/
DAL_StatusTypeDef DAL_IRDA_RegisterCallback(IRDA_HandleTypeDef *hirda, DAL_IRDA_CallbackIDTypeDef CallbackID, pIRDA_CallbackTypeDef pCallback);
DAL_StatusTypeDef DAL_IRDA_UnRegisterCallback(IRDA_HandleTypeDef *hirda, DAL_IRDA_CallbackIDTypeDef CallbackID);
#endif /* USE_DAL_IRDA_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup IRDA_Exported_Functions_Group2
  * @{
  */
/* IO operation functions *******************************************************/
DAL_StatusTypeDef DAL_IRDA_Transmit(IRDA_HandleTypeDef *hirda, const uint8_t *pData, uint16_t Size, uint32_t Timeout);
DAL_StatusTypeDef DAL_IRDA_Receive(IRDA_HandleTypeDef *hirda, uint8_t *pData, uint16_t Size, uint32_t Timeout);
DAL_StatusTypeDef DAL_IRDA_Transmit_IT(IRDA_HandleTypeDef *hirda, const uint8_t *pData, uint16_t Size);
DAL_StatusTypeDef DAL_IRDA_Receive_IT(IRDA_HandleTypeDef *hirda, uint8_t *pData, uint16_t Size);
DAL_StatusTypeDef DAL_IRDA_Transmit_DMA(IRDA_HandleTypeDef *hirda, const uint8_t *pData, uint16_t Size);
DAL_StatusTypeDef DAL_IRDA_Receive_DMA(IRDA_HandleTypeDef *hirda, uint8_t *pData, uint16_t Size);
DAL_StatusTypeDef DAL_IRDA_DMAPause(IRDA_HandleTypeDef *hirda);
DAL_StatusTypeDef DAL_IRDA_DMAResume(IRDA_HandleTypeDef *hirda);
DAL_StatusTypeDef DAL_IRDA_DMAStop(IRDA_HandleTypeDef *hirda);
/* Transfer Abort functions */
DAL_StatusTypeDef DAL_IRDA_Abort(IRDA_HandleTypeDef *hirda);
DAL_StatusTypeDef DAL_IRDA_AbortTransmit(IRDA_HandleTypeDef *hirda);
DAL_StatusTypeDef DAL_IRDA_AbortReceive(IRDA_HandleTypeDef *hirda);
DAL_StatusTypeDef DAL_IRDA_Abort_IT(IRDA_HandleTypeDef *hirda);
DAL_StatusTypeDef DAL_IRDA_AbortTransmit_IT(IRDA_HandleTypeDef *hirda);
DAL_StatusTypeDef DAL_IRDA_AbortReceive_IT(IRDA_HandleTypeDef *hirda);

void DAL_IRDA_IRQHandler(IRDA_HandleTypeDef *hirda);
void DAL_IRDA_TxCpltCallback(IRDA_HandleTypeDef *hirda);
void DAL_IRDA_RxCpltCallback(IRDA_HandleTypeDef *hirda);
void DAL_IRDA_TxHalfCpltCallback(IRDA_HandleTypeDef *hirda);
void DAL_IRDA_RxHalfCpltCallback(IRDA_HandleTypeDef *hirda);
void DAL_IRDA_ErrorCallback(IRDA_HandleTypeDef *hirda);
void DAL_IRDA_AbortCpltCallback(IRDA_HandleTypeDef *hirda);
void DAL_IRDA_AbortTransmitCpltCallback(IRDA_HandleTypeDef *hirda);
void DAL_IRDA_AbortReceiveCpltCallback(IRDA_HandleTypeDef *hirda);
/**
  * @}
  */

/** @addtogroup IRDA_Exported_Functions_Group3
  * @{
  */
/* Peripheral State functions  **************************************************/
DAL_IRDA_StateTypeDef DAL_IRDA_GetState(IRDA_HandleTypeDef *hirda);
uint32_t DAL_IRDA_GetError(IRDA_HandleTypeDef *hirda);
/**
  * @}
  */

/**
  * @}
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup IRDA_Private_Constants IRDA Private Constants
  * @{
  */

/** @brief IRDA interruptions flag mask
  *
  */
#define IRDA_IT_MASK  ((uint32_t) USART_CTRL1_PEIEN | USART_CTRL1_TXBEIEN | USART_CTRL1_TXCIEN | USART_CTRL1_RXBNEIEN | \
                                  USART_CTRL1_IDLEIEN | USART_CTRL2_LBDIEN | USART_CTRL3_CTSIEN | USART_CTRL3_ERRIEN )

#define IRDA_CTRL1_REG_INDEX         1U
#define IRDA_CTRL2_REG_INDEX         2U
#define IRDA_CTRL3_REG_INDEX         3U
/**
  * @}
  */

/* Private macros --------------------------------------------------------*/
/** @defgroup IRDA_Private_Macros   IRDA Private Macros
  * @{
  */
#define IS_IRDA_WORD_LENGTH(LENGTH)   (((LENGTH) == IRDA_WORDLENGTH_8B) || \
                                       ((LENGTH) == IRDA_WORDLENGTH_9B))

#define IS_IRDA_PARITY(PARITY)        (((PARITY) == IRDA_PARITY_NONE) || \
                                       ((PARITY) == IRDA_PARITY_EVEN) || \
                                       ((PARITY) == IRDA_PARITY_ODD))

#define IS_IRDA_MODE(MODE)            ((((MODE) & 0x0000FFF3U) == 0x00U) && ((MODE) != 0x00000000U))

#define IS_IRDA_POWERMODE(MODE)       (((MODE) == IRDA_POWERMODE_LOWPOWER) || \
                                       ((MODE) == IRDA_POWERMODE_NORMAL))

#define IS_IRDA_BAUDRATE(BAUDRATE)    ((BAUDRATE) < 115201U)

#if defined(APM32F403xx) || defined(APM32F402xx)
#define IRDA_DIV(_PCLK_, _BAUD_)      (((_PCLK_)*25U)/(4U*(_BAUD_)))
#else
#define IRDA_DIV(_PCLK_, _BAUD_)      ((uint32_t)((((uint64_t)(_PCLK_))*25U)/(4U*(((uint64_t)(_BAUD_))))))
#endif /* APM32F403xx || APM32F402xx */

#define IRDA_DIVMANT(_PCLK_, _BAUD_)  (IRDA_DIV((_PCLK_), (_BAUD_))/100U)

#define IRDA_DIVFRAQ(_PCLK_, _BAUD_)  ((((IRDA_DIV((_PCLK_), (_BAUD_)) - (IRDA_DIVMANT((_PCLK_), (_BAUD_)) * 100U)) * 16U) + 50U) / 100U)

/* UART BR = mantissa + overflow + fraction
            = (UART DIVMANT << 4) + (UART DIVFRAQ & 0xF0) + (UART DIVFRAQ & 0x0FU) */
#define IRDA_BR(_PCLK_, _BAUD_)      (((IRDA_DIVMANT((_PCLK_), (_BAUD_)) << 4U) + \
                                        (IRDA_DIVFRAQ((_PCLK_), (_BAUD_)) & 0xF0U)) + \
                                        (IRDA_DIVFRAQ((_PCLK_), (_BAUD_)) & 0x0FU))

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup IRDA_Private_Functions IRDA Private Functions
  * @{
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DAL_IRDA_H */

